node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "cond/Switch"
  op: "Switch"
  input: "IsVariableInitialized"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_t"
  op: "Identity"
  input: "cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/switch_f"
  op: "Identity"
  input: "cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/pred_id"
  op: "Identity"
  input: "IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/read"
  op: "Identity"
  input: "cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "cond/Merge"
  op: "Merge"
  input: "cond/Switch_1"
  input: "cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "add"
  op: "Add"
  input: "cond/Merge"
  input: "add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 145
          }
          dim {
            size: 4
          }
        }
        tensor_content: "333333\031@ffffff\n@\000\000\000\000\000\000\030@\000\000\000\000\000\000\004@\000\000\000\000\000\000\024@\000\000\000\000\000\000\014@\315\314\314\314\314\314\364?333333\323?\315\314\314\314\314\314\032@\315\314\314\314\314\314\010@\315\314\314\314\314\314\022@\000\000\000\000\000\000\370?333333\033@ffffff\006@333333\023@ffffff\366?ffffff\030@ffffff\006@\000\000\000\000\000\000\020@\315\314\314\314\314\314\364?ffffff\030@\315\314\314\314\314\314\004@ffffff\026@ffffff\366?\232\231\231\231\231\231\031@\232\231\231\231\231\231\t@\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?ffffff\030@ffffff\006@\315\314\314\314\314\314\022@333333\363?\000\000\000\000\000\000\032@ffffff\006@ffffff\022@\000\000\000\000\000\000\370?ffffff\030@333333\007@\315\314\314\314\314\314\022@ffffff\366?\232\231\231\231\231\231\023@\315\314\314\314\314\314\010@\000\000\000\000\000\000\370?\232\231\231\231\231\231\271?\000\000\000\000\000\000\030@333333\007@\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?\000\000\000\000\000\000\026@\315\314\314\314\314\314\004@\232\231\231\231\231\231\021@333333\363?333333\023@\000\000\000\000\000\000\010@ffffff\366?333333\323?\232\231\231\231\231\231\025@333333\017@\315\314\314\314\314\314\364?\232\231\231\231\231\231\331?ffffff\026@ffffff\006@\232\231\231\231\231\231\023@\000\000\000\000\000\000\000@ffffff\026@\000\000\000\000\000\000\010@\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?333333\023@333333\013@ffffff\376?\232\231\231\231\231\231\311?\232\231\231\231\231\231\021@333333\007@ffffff\366?\232\231\231\231\231\231\311?\315\314\314\314\314\314\030@ffffff\006@333333\023@\315\314\314\314\314\314\374?ffffff\022@\315\314\314\314\314\314\014@\000\000\000\000\000\000\360?\232\231\231\231\231\231\311?ffffff\024@ffffff\016@ffffff\376?\232\231\231\231\231\231\331?\315\314\314\314\314\314\030@333333\007@333333\021@\315\314\314\314\314\314\364?\000\000\000\000\000\000\024@ffffff\002@ffffff\n@\000\000\000\000\000\000\360?\000\000\000\000\000\000\024@333333\013@\232\231\231\231\231\231\371?\232\231\231\231\231\231\331?\232\231\231\231\231\231\031@\315\314\314\314\314\314\010@\000\000\000\000\000\000\026@\315\314\314\314\314\314\374?\232\231\231\231\231\231\025@\000\000\000\000\000\000\010@\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?\315\314\314\314\314\314\024@\000\000\000\000\000\000\014@\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?ffffff\030@\000\000\000\000\000\000\010@\232\231\231\231\231\231\023@\315\314\314\314\314\314\374?\232\231\231\231\231\231\031@ffffff\006@ffffff\026@\232\231\231\231\231\231\001@\315\314\314\314\314\314\024@\232\231\231\231\231\231\005@333333\017@ffffff\366?\315\314\314\314\314\314\026@ffffff\016@333333\373?333333\323?\000\000\000\000\000\000\030@\232\231\231\231\231\231\005@ffffff\024@\232\231\231\231\231\231\371?\232\231\231\231\231\231\027@\000\000\000\000\000\000\010@\315\314\314\314\314\314\020@\000\000\000\000\000\000\370?333333\027@\315\314\314\314\314\314\004@\000\000\000\000\000\000\020@333333\363?333333\033@\000\000\000\000\000\000\010@\000\000\000\000\000\000\026@\315\314\314\314\314\314\000@\315\314\314\314\314\314\022@\232\231\231\231\231\231\t@\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?\232\231\231\231\231\231\033@\315\314\314\314\314\314\010@ffffff\024@ffffff\002@\000\000\000\000\000\000\024@\000\000\000\000\000\000\014@\232\231\231\231\231\231\371?333333\343?\232\231\231\231\231\231\025@\232\231\231\231\231\231\r@\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?\000\000\000\000\000\000\024@\000\000\000\000\000\000\000@\000\000\000\000\000\000\014@\000\000\000\000\000\000\360?\000\000\000\000\000\000\032@\000\000\000\000\000\000\010@\000\000\000\000\000\000\026@\315\314\314\314\314\314\374?\315\314\314\314\314\314\032@ffffff\n@\315\314\314\314\314\314\026@\000\000\000\000\000\000\004@\000\000\000\000\000\000\030@\232\231\231\231\231\231\001@\000\000\000\000\000\000\024@\000\000\000\000\000\000\370?\315\314\314\314\314\314\032@\000\000\000\000\000\000\004@333333\027@\315\314\314\314\314\314\374?ffffff\026@\000\000\000\000\000\000\004@333333\017@\232\231\231\231\231\231\361?\315\314\314\314\314\314\036@\000\000\000\000\000\000\010@ffffff\030@ffffff\002@333333\031@ffffff\n@\315\314\314\314\314\314\022@\232\231\231\231\231\231\371?\000\000\000\000\000\000\026@333333\003@ffffff\016@\232\231\231\231\231\231\361?333333\031@\232\231\231\231\231\231\005@\232\231\231\231\231\231\023@\315\314\314\314\314\314\374?333333\031@ffffff\006@ffffff\024@\000\000\000\000\000\000\370?\232\231\231\231\231\231\023@\000\000\000\000\000\000\004@\000\000\000\000\000\000\022@333333\373?333333\031@\000\000\000\000\000\000\004@\000\000\000\000\000\000\024@ffffff\376?\000\000\000\000\000\000\034@\232\231\231\231\231\231\t@\315\314\314\314\314\314\022@ffffff\366?\000\000\000\000\000\000\032@\000\000\000\000\000\000\010@\315\314\314\314\314\314\024@\000\000\000\000\000\000\000@\000\000\000\000\000\000\030@333333\013@\000\000\000\000\000\000\022@\232\231\231\231\231\231\371?333333\023@\315\314\314\314\314\314\010@\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?333333\027@\232\231\231\231\231\231\005@ffffff\024@ffffff\376?ffffff\026@\232\231\231\231\231\231\005@\315\314\314\314\314\314\020@\315\314\314\314\314\314\364?ffffff\026@333333\007@\315\314\314\314\314\314\014@\315\314\314\314\314\314\364?\000\000\000\000\000\000\026@\000\000\000\000\000\000\004@\000\000\000\000\000\000\020@\315\314\314\314\314\314\364?ffffff\030@\000\000\000\000\000\000\010@ffffff\022@ffffff\366?\315\314\314\314\314\314\034@\232\231\231\231\231\231\t@\000\000\000\000\000\000\030@\315\314\314\314\314\314\374?333333\025@\232\231\231\231\231\231\r@\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?333333\021@\000\000\000\000\000\000\010@\232\231\231\231\231\231\361?\232\231\231\231\231\231\271?\232\231\231\231\231\231\031@\232\231\231\231\231\231\005@333333\025@ffffff\376?\315\314\314\314\314\314\026@\000\000\000\000\000\000\010@\315\314\314\314\314\314\020@333333\363?\232\231\231\231\231\231\025@333333\013@333333\373?\232\231\231\231\231\231\311?\315\314\314\314\314\314\026@\232\231\231\231\231\231\021@\000\000\000\000\000\000\370?\232\231\231\231\231\231\331?\232\231\231\231\231\231\033@\315\314\314\314\314\314\010@\232\231\231\231\231\231\023@\000\000\000\000\000\000\370?ffffff\022@\315\314\314\314\314\314\010@\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?\232\231\231\231\231\231\027@\000\000\000\000\000\000\010@ffffff\024@\315\314\314\314\314\314\374?ffffff\024@\000\000\000\000\000\000\004@\000\000\000\000\000\000\010@\232\231\231\231\231\231\361?ffffff\022@333333\013@ffffff\366?333333\323?\315\314\314\314\314\314\030@\232\231\231\231\231\231\001@\000\000\000\000\000\000\022@\000\000\000\000\000\000\370?\315\314\314\314\314\314\034@\315\314\314\314\314\314\014@ffffff\030@\000\000\000\000\000\000\004@\315\314\314\314\314\314\026@333333\007@\315\314\314\314\314\314\020@\315\314\314\314\314\314\364?333333\023@\000\000\000\000\000\000\010@ffffff\366?\232\231\231\231\231\231\271?ffffff\034@\000\000\000\000\000\000\010@\232\231\231\231\231\231\027@\315\314\314\314\314\314\000@\232\231\231\231\231\231\033@\232\231\231\231\231\231\t@\315\314\314\314\314\314\026@ffffff\002@\000\000\000\000\000\000\032@\000\000\000\000\000\000\010@333333\027@\232\231\231\231\231\231\001@\232\231\231\231\231\231\031@ffffff\006@ffffff\026@\315\314\314\314\314\314\000@ffffff\024@ffffff\016@\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?333333\023@333333\013@\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?\000\000\000\000\000\000\032@\232\231\231\231\231\231\t@ffffff\024@\000\000\000\000\000\000\000@\315\314\314\314\314\314\032@ffffff\n@\315\314\314\314\314\314\026@\315\314\314\314\314\314\000@\000\000\000\000\000\000\022@ffffff\002@\315\314\314\314\314\314\364?333333\323?\315\314\314\314\314\314\030@333333\013@\232\231\231\231\231\231\025@ffffff\002@\232\231\231\231\231\231\023@\000\000\000\000\000\000\010@ffffff\366?\232\231\231\231\231\231\311?\315\314\314\314\314\314\026@\000\000\000\000\000\000\004@\000\000\000\000\000\000\024@\000\000\000\000\000\000\000@\232\231\231\231\231\231\033@\315\314\314\314\314\314\010@\232\231\231\231\231\231\025@\315\314\314\314\314\314\000@\232\231\231\231\231\231\021@\232\231\231\231\231\231\t@\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?\000\000\000\000\000\000\024@\315\314\314\314\314\314\014@ffffff\366?\232\231\231\231\231\231\311?\315\314\314\314\314\314\034@\000\000\000\000\000\000\010@333333\027@\232\231\231\231\231\231\371?ffffff\024@\000\000\000\000\000\000\014@ffffff\366?333333\323?\232\231\231\231\231\231\021@\000\000\000\000\000\000\010@\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?\232\231\231\231\231\231\025@333333\017@333333\373?\232\231\231\231\231\231\331?\000\000\000\000\000\000\026@ffffff\002@\000\000\000\000\000\000\020@\315\314\314\314\314\314\364?333333\033@\232\231\231\231\231\231\t@\232\231\231\231\231\231\027@ffffff\002@ffffff\036@\000\000\000\000\000\000\010@ffffff\032@\315\314\314\314\314\314\000@ffffff\024@\000\000\000\000\000\000\014@ffffff\366?\232\231\231\231\231\231\311?\232\231\231\231\231\231\023@\315\314\314\314\314\314\010@\000\000\000\000\000\000\370?\232\231\231\231\231\231\271?\315\314\314\314\314\314\024@333333\013@ffffff\366?\232\231\231\231\231\231\311?\315\314\314\314\314\314\026@ffffff\006@\000\000\000\000\000\000\022@\315\314\314\314\314\314\364?ffffff\032@\000\000\000\000\000\000\010@\232\231\231\231\231\231\021@ffffff\366?\000\000\000\000\000\000\024@\232\231\231\231\231\231\t@333333\363?\232\231\231\231\231\231\311?ffffff\024@ffffff\n@333333\373?\000\000\000\000\000\000\340?\232\231\231\231\231\231\031@333333\007@333333\021@\315\314\314\314\314\314\364?\232\231\231\231\231\231\025@333333\013@\000\000\000\000\000\000\370?\232\231\231\231\231\231\331?\315\314\314\314\314\314\036@\315\314\314\314\314\314\004@\232\231\231\231\231\231\033@ffffff\002@\232\231\231\231\231\231\023@333333\003@ffffff\n@\000\000\000\000\000\000\360?\232\231\231\231\231\231\037@ffffff\016@\232\231\231\231\231\231\031@\000\000\000\000\000\000\000@\315\314\314\314\314\314\032@\315\314\314\314\314\314\010@\232\231\231\231\231\231\021@ffffff\366?\315\314\314\314\314\314\024@ffffff\020@\000\000\000\000\000\000\370?\232\231\231\231\231\231\271?\000\000\000\000\000\000\030@\000\000\000\000\000\000\010@333333\023@\315\314\314\314\314\314\374?333333\027@\000\000\000\000\000\000\020@333333\363?\232\231\231\231\231\231\311?\315\314\314\314\314\314\036@ffffff\006@\315\314\314\314\314\314\032@\000\000\000\000\000\000\000@ffffff\024@ffffff\016@\000\000\000\000\000\000\370?333333\323?\315\314\314\314\314\314\022@\232\231\231\231\231\231\t@\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?\232\231\231\231\231\231\035@ffffff\006@ffffff\030@ffffff\376?\000\000\000\000\000\000\024@ffffff\n@ffffff\366?\232\231\231\231\231\231\311?333333\031@333333\013@ffffff\026@333333\003@\315\314\314\314\314\314\026@ffffff\006@ffffff\020@\315\314\314\314\314\314\364?333333\027@\232\231\231\231\231\231\005@333333\017@333333\363?\315\314\314\314\314\314\026@\315\314\314\314\314\314\004@\000\000\000\000\000\000\014@\000\000\000\000\000\000\360?\232\231\231\231\231\231\031@\232\231\231\231\231\231\t@333333\025@ffffff\002@\315\314\314\314\314\314\032@\000\000\000\000\000\000\010@\315\314\314\314\314\314\024@ffffff\002@333333\031@\000\000\000\000\000\000\004@\232\231\231\231\231\231\023@\000\000\000\000\000\000\370?\315\314\314\314\314\314\032@\000\000\000\000\000\000\010@\000\000\000\000\000\000\024@333333\373?\000\000\000\000\000\000\024@\000\000\000\000\000\000\010@\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?\000\000\000\000\000\000\026@333333\003@\232\231\231\231\231\231\r@\000\000\000\000\000\000\360?\315\314\314\314\314\314\032@\315\314\314\314\314\314\010@ffffff\026@333333\003@333333\027@\232\231\231\231\231\231\005@ffffff\024@ffffff\376?ffffff\024@333333\013@\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?ffffff\032@333333\007@ffffff\022@\315\314\314\314\314\314\364?ffffff\026@\000\000\000\000\000\000\010@ffffff\020@\315\314\314\314\314\314\364?\232\231\231\231\231\231\027@\232\231\231\231\231\231\t@333333\023@\315\314\314\314\314\314\374?333333\031@ffffff\002@\232\231\231\231\231\231\021@\315\314\314\314\314\314\364?\000\000\000\000\000\000\026@\000\000\000\000\000\000\014@\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?ffffff\024@\232\231\231\231\231\231\r@\000\000\000\000\000\000\370?\232\231\231\231\231\231\331?\232\231\231\231\231\231\023@\315\314\314\314\314\314\010@\000\000\000\000\000\000\370?\232\231\231\231\231\231\271?333333\031@333333\007@ffffff\026@\315\314\314\314\314\314\374?333333\027@\232\231\231\231\231\231\005@ffffff\020@\000\000\000\000\000\000\360?\315\314\314\314\314\314\036@ffffff\016@\315\314\314\314\314\314\032@\232\231\231\231\231\231\001@ffffff\022@\232\231\231\231\231\231\t@ffffff\366?\232\231\231\231\231\231\311?"
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 145
          }
        }
        tensor_content: "\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/ToFloat"
  op: "Cast"
  input: "Const"
  input: "^add"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/Shape"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\221\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/strided_slice/stack"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/strided_slice/stack_1"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/strided_slice/stack_2"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/strided_slice"
  op: "StridedSlice"
  input: "linear/linear_model/flower_features/Shape"
  input: "linear/linear_model/flower_features/strided_slice/stack"
  input: "linear/linear_model/flower_features/strided_slice/stack_1"
  input: "linear/linear_model/flower_features/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "linear/linear_model/flower_features/Reshape/shape/1"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/Reshape/shape"
  op: "Pack"
  input: "linear/linear_model/flower_features/strided_slice"
  input: "linear/linear_model/flower_features/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear/linear_model/flower_features/Reshape"
  op: "Reshape"
  input: "linear/linear_model/flower_features/ToFloat"
  input: "linear/linear_model/flower_features/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/weights/part_0/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/flower_features/weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 3
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/weights/part_0"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/flower_features/weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear/linear_model/flower_features/weights/part_0/Assign"
  op: "Assign"
  input: "linear/linear_model/flower_features/weights/part_0"
  input: "linear/linear_model/flower_features/weights/part_0/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/flower_features/weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear/linear_model/flower_features/weights/part_0/read"
  op: "Identity"
  input: "linear/linear_model/flower_features/weights/part_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/flower_features/weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/weights"
  op: "Identity"
  input: "linear/linear_model/flower_features/weights/part_0/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/flower_features/weighted_sum"
  op: "MatMul"
  input: "linear/linear_model/flower_features/Reshape"
  input: "linear/linear_model/flower_features/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "linear/linear_model/weighted_sum_no_bias"
  op: "Identity"
  input: "linear/linear_model/flower_features/weighted_sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/bias_weights/part_0/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/bias_weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "linear/linear_model/bias_weights/part_0"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/bias_weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear/linear_model/bias_weights/part_0/Assign"
  op: "Assign"
  input: "linear/linear_model/bias_weights/part_0"
  input: "linear/linear_model/bias_weights/part_0/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/bias_weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear/linear_model/bias_weights/part_0/read"
  op: "Identity"
  input: "linear/linear_model/bias_weights/part_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@linear/linear_model/bias_weights/part_0"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/bias_weights"
  op: "Identity"
  input: "linear/linear_model/bias_weights/part_0/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/linear_model/weighted_sum"
  op: "BiasAdd"
  input: "linear/linear_model/weighted_sum_no_bias"
  input: "linear/linear_model/bias_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "linear/head/logits/Shape"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\221\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "linear/head/logits/assert_rank/rank"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "linear/head/logits/assert_rank/assert_type/statically_determined_correct_type"
  op: "NoOp"
  input: "^add"
}
node {
  name: "linear/head/logits/assert_rank/static_checks_determined_all_ok"
  op: "NoOp"
  input: "^add"
}
node {
  name: "linear/head/logits/strided_slice/stack"
  op: "Const"
  input: "^add"
  input: "^linear/head/logits/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/head/logits/strided_slice/stack_1"
  op: "Const"
  input: "^add"
  input: "^linear/head/logits/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "linear/head/logits/strided_slice/stack_2"
  op: "Const"
  input: "^add"
  input: "^linear/head/logits/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/head/logits/strided_slice"
  op: "StridedSlice"
  input: "linear/head/logits/Shape"
  input: "linear/head/logits/strided_slice/stack"
  input: "linear/head/logits/strided_slice/stack_1"
  input: "linear/head/logits/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "linear/head/logits/assert_equal/x"
  op: "Const"
  input: "^add"
  input: "^linear/head/logits/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "linear/head/logits/assert_equal/Equal"
  op: "Equal"
  input: "linear/head/logits/assert_equal/x"
  input: "linear/head/logits/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "linear/head/logits/assert_equal/Const"
  op: "Const"
  input: "^add"
  input: "^linear/head/logits/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "linear/head/logits/assert_equal/All"
  op: "All"
  input: "linear/head/logits/assert_equal/Equal"
  input: "linear/head/logits/assert_equal/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "linear/head/logits/assert_equal/Assert/Assert"
  op: "Assert"
  input: "linear/head/logits/assert_equal/All"
  input: "linear/head/logits/Shape"
  attr {
    key: "T"
    value {
      list {
        type: DT_INT32
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "linear/head/logits"
  op: "Identity"
  input: "linear/linear_model/weighted_sum"
  input: "^linear/head/logits/assert_rank/static_checks_determined_all_ok"
  input: "^linear/head/logits/assert_equal/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/head/predictions/class_ids/dimension"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/head/predictions/class_ids"
  op: "ArgMax"
  input: "linear/head/logits"
  input: "linear/head/predictions/class_ids/dimension"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
        }
      }
    }
  }
  attr {
    key: "output_type"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "linear/head/predictions/ExpandDims/dim"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/head/predictions/ExpandDims"
  op: "ExpandDims"
  input: "linear/head/predictions/class_ids"
  input: "linear/head/predictions/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/head/predictions/str_classes"
  op: "AsString"
  input: "linear/head/predictions/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "fill"
    value {
      s: ""
    }
  }
  attr {
    key: "precision"
    value {
      i: -1
    }
  }
  attr {
    key: "scientific"
    value {
      b: false
    }
  }
  attr {
    key: "shortest"
    value {
      b: false
    }
  }
  attr {
    key: "width"
    value {
      i: -1
    }
  }
}
node {
  name: "linear/head/predictions/probabilities"
  op: "Softmax"
  input: "linear/head/logits"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "linear/head/maybe_expand_dim/ExpandDims/dim"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "linear/head/maybe_expand_dim/ExpandDims"
  op: "ExpandDims"
  input: "Const_1"
  input: "linear/head/maybe_expand_dim/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 145
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "linear/head/labels/Shape"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\221\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "linear/head/labels/assert_rank/rank"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "linear/head/labels/assert_rank/Shape"
  op: "Const"
  input: "^add"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\221\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "linear/head/labels/assert_rank/assert_type/statically_determined_correct_type"
  op: "NoOp"
  input: "^add"
}
node {
  name: "linear/head/labels/assert_rank/static_checks_determined_all_ok"
  op: "NoOp"
  input: "^add"
}
node {
  name: "linear/head/labels/strided_slice/stack"
  op: "Const"
  input: "^add"
  input: "^linear/head/labels/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear/head/labels/strided_slice/stack_1"
  op: "Const"
  input: "^add"
  input: "^linear/head/labels/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "linear/head/labels/strided_slice/stack_2"
  op: "Const"
  input: "^add"
  input: "^linear/head/labels/assert_rank/static_checks_determined_all_ok"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
